#Создать список
# заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

list=[1, 45, 39, 'lion', False, 'age']

for el in list:
    print (type (el))
