#Узнайте у пользователя число n.
# Найдите сумму чисел n + nn + nnn.

number=input('Введите число: ')
nn=number*2
nnn=number*3
x=int(number)+int(nn)+int(nnn)
print (x)
